# Application Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalCommandData..::..Application Property
ExternalCommandData Class See Also
---
Retrieves an object that represents the current Application for external command.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UIApplication Application { get; set; }
```

Visual Basic
---
```text
Public Property Application As UIApplication
	Get
	Set
```

Visual C++
---
```text
public:
property UIApplication^ Application {
	UIApplication^ get ();
	void set (UIApplication^ value);
}
```

# See Also
ExternalCommandData Class
Autodesk.Revit.UI Namespace